#language: ru

Функция: Вход в систему в качестве администратора

  Предыстория:
    Пусть существует пользователь "user1" с параметрами:
      | login    | admin    |
      | password | admin123 |
      | admin    | true     |
      | status   | 1        |
    И существует проект со статусом публичности "false" c сохраненным по ключу "keyName" именем
    И открыт браузер на главной странице


  @feature
  Сценарий: Вход в систему в качестве администратора системы
    Если авторизоваться пользователем "user1"
    И на главной странице отображается поле "Домашняя страница"
    И на странице "Домашняя страница" нажать кнопку "Проекты"
    И открыта страница по пути "http://edu-at.dfu.i-teco.ru/projects"
    И на странице "Проекты" отображается "список проектов" с ранее сохраненным именем по ключу "keyName"