#language: ru
Функция: Калькулятор.


    @feature
  Сценарий: Калькулятор.
#Step_1
    Если в калькуляторе "сложить" числа 3 и 8 и сохранить результат в переменную "результат сложения"
    То значение переменной "результат сложения" равно 11
#Step_2
    Если в калькуляторе "вычесть" числа 10 и 2 и сохранить результат в переменную "результат вычитания"
    То значение переменной "результат вычитания" равно 8
#Step_3
    Если в калькуляторе "разделить" числа 12 и 2 и сохранить результат в переменную "результат деления"
    То значение переменной "результат деления" равно 6
#Step_4
    Если в калькуляторе "умножить" числа 2 и 6 и сохранить результат в переменную "результат умножения"
    То значение переменной "результат умножения" равно 12